<h1>
    换成了 .com 域名
    <date>2017/9/12</date>
</h1>

前天，SardineFish 发现我的域名 dwscdv3.ga 解析到了一个错误的 IP 上。

我打开网站一看，上面是 Freenom World DNS 的广告。

顿时我就明白，八成是域名过期了，遂打开 Freenom 官网准备续订。

可是，登录页 HTTP 500 错误。

我天真地以为这是 Freenom 的服务器碰巧出故障了，于是等了一天…… 两天……

还等个毛啊，再修不好我就去别家了（

今天在搜索相关信息的时候看到 V2EX 上有篇帖子提到这件事，下面有个人跟帖回复说 Freenom 屏蔽了 HTTP Accept-Language 为中文的连接。

死马当活马医吧，我去试了试。

然后居然真的能进了……

可是我的域名列表和续费列表里怎么都没有看见我的域名嗯？

到注册域名那里搜了一下，发现我的域名变成了可以注册的状态，但是是特殊域名，要收 10 美元一年。

行，好吧。我不要了还不行么。

反正注册免费域名也只能拿来玩玩，迟早要换的。

然后花了两三个小时的时间去调查比较了几家知名的域名商。（防止广告嫌疑我就用化名了 233）

- __狗爹__，不是一般的贵。
- __贱名__，官网在我这要用魔法打开，价格适中。
- __阿里郎__，价格实惠，然而需要实名认证 ┑(￣Д ￣)┍
- __筒仓__，界面老土，价格实惠，OK 就你了（

于是我以 5 刀首年的价格买了目前这个域名，dwscdv3.com，并且与 Freenom 一刀两断。

你问我为什么不买 .net .me .moe .im 这些？当然是因为<ruby>贵<rt>qióng</ruby>啊（（

现在，新域名是搞定了……（确切地说，还得等 DNS 解析生效）

然而…… 我有数不清的社交网络资料上还留着我的旧域名，这光是从记忆里挖掘出我有哪些需要修改的资料就够麻烦的了……（捂脸

当然最麻烦的还是因为域名更换，我的 Cloudflare 和各搜索引擎的站长平台里的配置都得整个删掉重新来过了！

不过也没有想象中那么繁琐（

毕竟半天时间就搞完了，嗯（